#მონაცემთა ტიპები:
#string- სტრინგ მონაცემია ბრჭყალებში '' "" მოცემული სიტყვა/მნიშვნელობა.
#integer - არის მთელი რიცხვი მაგ. 123  12 და აშ.
#float- არის ათწილადი რიცხვი მაგ. 12.5 35.5 და აშ.

#ცვლადი - არის 'ყუტი' რომელშიც არის გარკვეული ინფორმაცია მოცემული.
#print ფუნქციით შეგვიძლია ტერმინალში გამოვიტანოთ ცვლადი.მაგ:.
name='givi'
print(name)

# შექმენი ცვლადი და შეინახე მასში შენი ქალაქის სახელი, შემდეგ გამოიტანე ტერმინალში 10-ჯერ.

city='Tbilisi '
print(city*10)

# შექმენი 4 ცვლადი, შეინახე მათში 4 სხვადასხვა წელი და გამოთვალე მათი საშუალო არითმეტიკული.
name=2001
name_2=1991
name_3=2026
name_4=2014
print((name+name_2+name_3+name_4)/4)

# შექმენი 3 ცვლადი და შეინახე მათში: 3 სხვადასხვა სპორტის სახელი და კონკატინაციის გამოყენებით დაპრინტე ისინი ერთ წინადადებად.
sport='football '
sport_2='basketball '
sport_3='baseball'
print(sport+sport_2+sport_3)

# შექმენი ცვლადი და შეინახე მასში შენი საყვარელი ფერი, შემდეგ გამოიტანე ტერმინალში 15-ჯერ.
fav_colour='black '
print(fav_colour*15)

# შექმენი 6 ცვლადი, შეინახე მათში 6 სხვადასხვა ფასის მნიშვნელობა და გამოთვალე მათი საშუალო არითმეტიკული.
num_1=10
num_2=20
num_3=30
num_4=40
num_5=50
num_6=676767
print((num_1+num_2+num_3+num_4+num_5+num_6)/6)

# შექმენი 3 ცვლადი და შეინახე მათში: 3 სხვადასხვა ფრინველის სახელი და კონკატენაციის გამოყენებით დაპრინტე ისინი ერთ წინადადებად.

bird='ofofi '
bird_2='kachkachi ' 
bird_3='yvavi'
print(bird+bird_2+bird_3)

# //
